{"conversations": [["Is cavendish a private or public university?", "cavendish university is a private university"], ["Is cavendish university accredited?", "Yes, CUU is accredited by the UNCHE since 2009."], ["Is cavendish university an international university?", "CUU is local university with partnership with other universities such as cavendish university Zambia."], ["What is the mission of Cavendish university?", "CUU mission is to transform students into responsible, educated, employable and entrepreneurial citizens."], ["Where does students come from?", "Students come from more than 15 countries including Kenya, South Sudan, DRC, Nigeria,India, etc."], ["How many campuses do you have?", "CUU have 3 campuses in Kampala - Siyani(Main Campus), Kingsgate and Acacia Mall."], ["What is the location of Cavendish university?", "CUU is located on Plot 1469 Nsambya Ggaba Road, opposite American Embassy"], ["Who is the chancellor", "Former Tanzanian Benjamin Mukapa is the chancellor of CUU."], ["Who is the vice chancellor?", "Prof. John F. Mugisha is the current vice-chancellor"], ["How can I apply?", "You can apply online on cavendish.ac.ug/why-cavendish or by visiting our main campus in Sambya."], ["Can I apply online?", "Yes, you can apply online on the following link - cavendish.ac.ug/why-cavendish"], ["How many intake do you have?", "There are 3 intakes at CUU - January, May and September."], ["Do you have online programs?", "CUU does offer distance learning programs instead of online learning programs."], ["What is the difference between online and distance learning?", "In the distance learning, Students are required to be physically present at campuss for to write final exams"], ["Do you have masters?", "Yes, CUU does offer masters programs."], ["Do you have masters in the business and administration?", "We offer masters of Business Administration generic, Accounting & Finance, Procurement & Supply Chain, Entrepreneurship and Human Resource."], ["What is the requirement for masters?", "To apply for Master, you must has at a second class lower. If you have a third class (pass), then a professional experience is required."], ["Does cavendish has a computer lab?", "CUU has modern and renewed computer lab at each of his campus."], ["Can I access the computer lab if I am not a student at cavendish university?", "computer lab are reserved for CUU students only."], ["How much is the tuition at cavendish university?", "The detailed tuition fees structure can be found here - https://cavendish.ac.ug/admissions/fee-structure"], ["How much is the tuition?", "The tuition varies with degree, course, semester and nationality. Find here the fees structure - https://cavendish.ac.ug/admissions/fee-structure"], ["How to pay for tutition?", "Tuition fees are paid in CUU bank accounts or using M-cash at Main Campus."], ["Hello", "Hi"], ["Hi", "Hello"], ["Greetings!", "Hello"], ["Hello", "Greetings!"], ["Hi, How is it going?", "Good"], ["Hi, How is it going?", "Fine"], ["Hi, How is it going?", "Okay"], ["Hi, How is it going?", "Great"], ["Hi, How is it going?", "Could be better."], ["Hi, How is it going?", "Not so great."], ["How are you doing?", "Good."], ["How are you doing?", "Very well, thanks."], ["How are you doing?", "Fine, and you?"], ["Nice to meet you.", "Thank you."], ["How do you do?", "I'm doing well."], ["How do you do?", "I'm doing well. How are you?"], ["Hi, nice to meet you.", "Thank you. You too."], ["It is a pleasure to meet you.", "Thank you. You too."], ["Top of the morning to you!", "Thank you kindly."], ["Top of the morning to you!", "And the rest of the day to you."], ["What's up?", "Not much."], ["What's up?", "Not too much."], ["What's up?", "Not much, how about you?"], ["What's up?", "Nothing much."], ["What's up?", "The sky's up but I'm fine thanks. What about you?"], ["Do you have law faculty?", "Yes, CUU has law faculty and it is hosted at Acacia Campus."], ["Do you have a library?", "CUU has libraries in all of its campuses."], ["What is the condition to use the library?", "You have to be a CUU student to use the library."], ["How many books do you in the library?", "We have more than 10,000 physical books plus more than 1 million books online"], ["Can I study at Cavendish if I am white?", "CUU does welcome students from all backgrounds and nationalities."], ["How many girls are at Cavendish?", "Female students represents more than 45% of CUU students while 53% of the administration body are women and girls."], ["Do you have Computer science?", "We do offer Bachelor of Computer science at our main campus in Sambya"], ["Do you have bachelor of Public health?", "The bachelor of Public Health is available at Cavendish university."], ["Does Cavendish has hostels?", "No, Cavendish doesn't own hostels. However there are many hostels around our campuses."]]}